// JS 연산자
// 1) 대입 연산자 2) 산술 연산자 3) 비교 연산자 4) 논리 연산자 

// 1. 산술 연산자
let a = 10;
let b = 5;
console.log("더하기 : ", a+b);
console.log("빼기 : ",a-b);
console.log("곱하기 : ",a*b);
console.log("나누기 : ",a/b);
console.log("나머지 : ",a%b);
console.log("거듭제곱 : ",a**b);
console.log("======================");
// 2. 비교 연산자
// 1) 동등 비교
// - 같다 : == , ===
// - 다르다 : !=, !==
// -> == , != : 값만 비교, 자료형은 비교 x
// -> === , !== : 값과 자료형 모두 비교 
console.log("== : ", 1 == "1");
console.log("!= : ", 1 != "1");
console.log("-----------------------");
console.log("=== : ", 1 === "1");
console.log("!== : ", 1 !== "1");
